Feature: Валидиране на чaс в календар

  Background: 
    Given Потребителят отваря екрана за запазване на час

  Scenario: Запазване на час при зъболекар с верни данни
    When Въведе "gerity59@gmail.com" е-поща
    And избере "2022-02-20"
    And и натисне бутона за запазване на час
    Then Вижда съобщение "Успешно запазихте час!"


    Scenario: Запазване на час при зъболекар с грешни данни
    When Въведе "MissingEmail" е-поща
    And избере "2022-02-20"
    And и натисне бутона за запазване на час
    Then Вижда съобщение "Грешни данни!"
    
    Scenario: Запазване на час при зъболекар с заета дата
    When Въведе "gerity59@gmail.com" е-поща
    And избере "2022-05-22"
    And и натисне бутона за запазване на час
    Then Вижда съобщение "Часът е зает!"
    
    Scenario: Запазване на час при зъболекар с невалидна дата и час
    When Въведе "gerity59@gmail.com" е-поща
    And избере  "2233-02-31";
    And и натисне бутона за запазване на час
    Then Вижда съобщение "Невалидни дата и час!"
	
	Scenario: Запазване на час при зъболекар с празна дата
    When Въведе "gerity59@gmail.com" е-поща
    And не избере "MissingDate"
    And и натисне бутона за запазване на час
    Then Вижда съобщение "Неуспешно запазен час!"